//****************************************************************************
//                             File CDROM.HPP
//
//               ATAPI CD-ROM drive hardware definitions
//
//    Copyright (c) 1996, 1999 Dmitry Stefankov. All rights reserved.
//
//****************************************************************************
//
//   $Source: d:/projects/hardware/atapicd/RCS/CDROM.HPP $
//  $RCSfile: CDROM.HPP $
//   $Author: dstef $
//     $Date: 2003/01/27 20:09:36 $
// $Revision: 1.2 $
//   $Locker: dstef $
//
//      $Log: CDROM.HPP $
//      Revision 1.2  2003/01/27 20:09:36  dstef
//      Fixed for DJGPP
//
//      Revision 1.1  1999/01/02 00:53:53  dstef
//      Initial revision
//
//
//****************************************************************************



//---------------------------Hardware Ports------------------------------------
const  WORD    ioPRIMARY_MAIN_CTRLR_IO_BASE    =  0x1F0;
const  WORD    ioPRIMARY_ALT_CTRLR_IO_BASE     =  0x3F0;    // 0x3F6
const  WORD    ioSECONDARY_MAIN_CTRLR_IO_BASE  =  0x170;
const  WORD    ioSECONDARY_ALT_CTRLR_IO_BASE   =  0x370;    // 0x376
const  WORD    ioTERTIARY_MAIN_CTRLR_IO_BASE   =  0x1E8;
const  WORD    ioTERTIARY_ALT_CTRLR_IO_BASE    =  0x3E8;    // 0x3EE
const  WORD    ioQUATERNARY_MAIN_CTRLR_IO_BASE =  0x168;
const  WORD    ioQUATERNARY_ALT_CTRLR_IO_BASE  =  0x368;    // 0x36E

const  BYTE    bPhysDrive0  = 0;            // Physical drive number 0
const  BYTE    bPhysDrive1  = 1;            // Physical drive number 1



//---------------------------ATAPI Generic Commands----------------------------
const  BYTE    bATAPI_cmd_Soft_Reset    =  0x08; // (M)andatory command
const  BYTE    bATAPI_cmd_Pkt_Command   =  0xA0; // (M)andatory command
const  BYTE    bATAPI_cmd_Identify_Dev  =  0xA1; // (M)andatory command
const  BYTE    bATAPI_cmd_Service       =  0xA2; // (O)ptional  command



//---------------------------Registers State after any Reset-------------------
const  BYTE    bReset_Reg_Error   =  0x01;  // Error
const  BYTE    bReset_Reg_SC      =  0x01;  // Sector count
const  BYTE    bReset_Reg_SN      =  0x01;  // Sector number
const  BYTE    bReset_Reg_Cyl_Lo  =  0x14;  // Cylinder low
const  BYTE    bReset_Reg_Cyl_Hi  =  0xEB;  // Cylinder high
const  BYTE    bReset_Reg_Drv_Hd  =  0x00;  // Drive/head
const  BYTE    bReset_Reg_Status  =  0x00;  // Status



//---------------------------ATAPI Register Map (Packet Command)---------------
#pragma pack(1)
struct  ATAPI_Ctrl_Block_Map_RD             // ATAPI Control Block Registers (READ)
{
    WORD  bFDC_A_Stat;                      // Floppy A status
    WORD  bFDC_B_Stat;                      // Floppy B status
    WORD  bUnused_1;                        // Unused
    union
    {
         WORD  bFDC_ID;                     // Floppy ID
         WORD  bTape_Ctrl;                  // Tape Control
    }  FloppyTape;
    WORD  bFDC_Stat;                        // Floppy Controller Status
    WORD  bFDC_DATA;                        // Floppy Data Register
    WORD  bATAPI_Stat_ALt;                  // Alternate ATAPI Status
    WORD  bUnused_2;                        // Unused
};

struct  ATAPI_Ctrl_Block_Map_WR             // ATAPI Control Block Registers (WRITE)
{
    WORD  bUnused_1;                        // Unused
    WORD  bUnused_2;                        // Unused
    WORD  bFDC_DOR;                         // Floppy Digital Output Register
    WORD  bReserved_1;                      // RESERVED
    WORD  bReserved_2;                      // RESERVED
    WORD  bFDC_DATA;                        // Floppy Data Register
    WORD  bDev_Ctrl;                        // Device Control
    WORD  bUnused_3;                        // Unused
};

struct  ATAPI_Cmd_Block_Map_RD              // ATAPI Command Block Registers (READ)
{
    WORD  wData;                            // Data
    WORD  bATAPI_Err;                       // ATAPI Error Register
    WORD  bATAPI_Intr_Reason;               // ATAPI Interrupt Reason Register
    WORD  bSAM_TAG;                         // Reserved for SAM TAG Byte
    WORD  bATAPI_Byte_Cnt_Lo;               // ATAPI Byte Count Register (bits 0-7)
    WORD  bATAPI_Byte_Cnt_Hi;               // ATAPI Byte Count Register (bits 8-15)
    WORD  bDrv_Sel;                         // Drive Select
    WORD  bATAPI_Stat;                      // ATAPI Status
};

struct  ATAPI_Cmd_Block_Map_WR              // ATAPI Command Block Registers (WRITE)
{
    WORD  wData;                            // Data
    WORD  bATAPI_Features;                  // ATAPI Features
    WORD  bATAPI_Unused;                    // Unused
    WORD  bSAM_TAG;                         // Reserved for SAM TAG Byte
    WORD  bATAPI_Byte_Cnt_Lo;               // ATAPI Byte Count Register (bits 0-7)
    WORD  bATAPI_Byte_Cnt_Hi;               // ATAPI Byte Count Register (bits 8-15)
    WORD  bDrv_Sel;                         // Drive Select
    WORD  bATA_Cmd;                         // ATA Command
};
#pragma pack()



//---------------------------ATAPI Registers BitMap----------------------------
#pragma pack(1)
struct  tagATAPI_Stat_Reg_RD                // ATAPI/ATA Status Register (READ)
{
    BYTE  CHECK      : 1;                   // Error occurred
    BYTE  RESERVED   : 1;                   // Not Used
    BYTE  CORR       : 1;                   // Correctable error occurred
    BYTE  DRQ        : 1;                   // Data request
    BYTE  SRVC_DSC   : 1;                   // Request service or interrupt
    BYTE  DMARDY_DF  : 1;                   // DMA ready to start or drive fault
    BYTE  DRDY       : 1;                   // ATA drive ready
    BYTE  BSY        : 1;                   // Busy if cmd block accessed by drive
};

typedef  tagATAPI_Stat_Reg_RD *  pATAPI_Stat_Reg_RD;
                                            //Pointer to bit structure

struct tagATAPI_Err_Reg_RD                  // ATAPI/ATA Error Register (READ)
{
    BYTE  ILI        : 1;                   // Illegal length indication
    BYTE  EOM        : 1;                   // End of media detected
    BYTE  ABRT       : 1;                   // Aborted command
    BYTE  MCR        : 1;                   // Media change requested
    BYTE  SENSE_KEY  : 4;                   // Defined is below!
};

typedef  tagATAPI_Err_Reg_RD *  pATAPI_Err_Reg_RD;
                                            //Pointer to bit structure

struct  ATAPI_Feature_Reg_WR                // ATAPI/ATA Feature Register (WRITE)
{
    BYTE  DMA       : 1;                    // DMA data transfer
    BYTE  OVERLAP   : 1;                    // May release ATA bus before cmd completion
    BYTE  RESERVED  : 6;                    // Future enhancements
};

struct  ATAPI_Intr_Reason_Reg_RD            // ATAPI Interrupt Reason Register (READ)
{                                           // (ATA Sector Count Register)
    BYTE  CoD       : 1;                    // Transfer type (0=user data, 1=cmd)
    BYTE  IO        : 1;                    // Direction of transfer (1=to host, 0=from host)
    BYTE  RELEASE   : 1;                    // ATA bus has released
    BYTE  RESERVED  : 5;                    // Reserved
};

// Use the following table to understand a data transfer:
//   IO   DRQ  CoD    Meaning
//    0    1    1     Command (ready to accept cmd pkt bytes)
//    1    1    1     Message (in future - ready to send message data to host)
//    1    1    0     Read Data (send cmd parameter data to host)
//    0    1    0     Write Data (receive cmd parameter data from host)
//    1    0    1     Status (same register contains completion status)


struct  ATAPI_Drv_Sel_Reg_RD_WR             // ATAPI Drive Select Register (READ/WRITE)
{                                           // (ATA Drive/Head Select Register)
    BYTE  SAM_LUN       : 4;                // Reserved
    BYTE  DRV           : 1;                // Select device (0=drive 0, 1=drive 1)
    BYTE  SET_ONE_1     : 1;                // Always 1 (ATA sector size = 512 bytes)
    BYTE  RESERVED      : 1;                // Reserved
    BYTE  SET_ONE_2     : 1;                // Always 1 (ATA CRC mode)
};

struct  ATAPI_Dev_Ctrl_Reg_WR               // ATAPI/ATA Device Control Register (WRITE)
{
    BYTE  SET_ZERO  : 1;                    // Always must be 0
    BYTE  nIEN      : 1;                    // 0=enable interrupts to host, 1=disable
    BYTE  SRST      : 1;                    // Software reset
    BYTE  SET_ONE   : 1;                    // Always must be 1 (ATA more 8 heads)
    BYTE  RESERVED  : 4;                    // Reserved
};
#pragma pack()



//---------------------------ATAPI Identify Data-------------------------------
#pragma pack(1)
struct  ATAPI_Identify_Dev_Data             // Identify Data return by same command
{                                           // Offset, Meaning
    WORD   wGeneralConfiguration;           // 0,  mandatory/fixed
    WORD   wCylinders;                      // 1,  ATA compatibility
    WORD   wReserved_1;                     // 2,  ATA compatibility
    WORD   wHeads;                          // 3,  ATA compatibility
    WORD   wUnfmtBytesPerTrack;             // 4,  ATA compatibility
    WORD   wUnfmtBytesPerSector;            // 5,  ATA compatibility
    WORD   wSectorPerTrack;                 // 6,  ATA compatibility
    WORD   wReserved_7;                     // 7,  ATA compatibility
    WORD   wReserved_8;                     // 8,  ATA compatibility
    WORD   wReserved_9;                     // 9,  ATA compatibility
    char   chSerialNumber[20];              // 10, optional/fixed
    WORD   wVendorSpecific_20;              // 20, ATA compatibility
    WORD   wVendorSpecific_21;              // 21, ATA compatibility
    WORD   wBytesECC;                       // 22, ATA compatibility
    char   chFirmwareRevision[8];           // 23, mandatory/fixed
    char   chModelNumber[40];               // 27, mandatory
    WORD   wMultSectorCount;                // 47, ATA compatibility
    WORD   wReserved_48;                    // 48, ATA compatibility
    WORD   wCapabilities;                   // 49, mandatory
    WORD   wReserved_50;                    // 50, ATA compatibility
    WORD   wPIO_Cycle_Timing;               // 51, mandatory/fixed
    WORD   wDMA_Cycle_Timing;               // 52, mandatory/fixed
    WORD   wValidity_53;                    // 53, mandatory
    WORD   wCurrentCyls;                    // 54, ATA compatibility
    WORD   wCurrentHeads;                   // 55, ATA compatibility
    WORD   wCurrentSectors;                 // 56, ATA compatibility
    DWORD  dwCurrentCapacity;               // 57, ATA compatibility
    WORD   Reserved_59;                     // 59, ATA compatibility
    DWORD  dwUserAddressableSectors;        // 60, ATA compatibility
    WORD   wSingleDMA_Modes;                // 62, mandatory
    WORD   wMultiDMA_Modes;                 // 63, mandatory
    WORD   wAdv_PIO_Modes;                  // 64, mandatory
    WORD   wMin_Mult_DMA_Xfr_Cycle_Time_Per_Word;   // 65, mandatory (ns)
    WORD   wManuf_Mult_DMA_Xfr_Time;                // 66, mandatory (ns)
    WORD   wMin_PIO_Xfr_Cycle_Time_No_Flow_Ctrl;    // 67, optional (ns)
    WORD   wMin_PIO_Xfr_Cycle_Time_IORDY_Flow_Ctrl; // 68, optional (ns)
    WORD   wAdv_PIO_Sup_69;                         // 69, ATA compatibility
    WORD   wAdv_PIO_Sup_70;                         // 70, ATA compatibility
    WORD   wTypTimeToReleaseAfterCmdReceived;       // 71, optional
    WORD   wTypTimeToReleaseAfterServiceCmd;        // 72, optional
    WORD   wMajorVersionNumber;             // 73, optional
    WORD   wMinorVersionNumber;             // 74, optional
    BYTE   bReserved_75[106];               // 75, ATA compatibility
    BYTE   bVendorUnique_128[64];           // 128, ATA compatibility
    BYTE   bReserved_160[192];              // 160, ATA compatibility
};

struct GeneralConfigFlags                   // General Configuration Word (0)
{
    WORD  CMD_PKT_SIZE      : 2;            // CMD Packet Size
    WORD  RESERVED_2_4      : 3;            // Reserved (unique for each protocol)
    WORD  CMD_DRQ_TYPE      : 2;            // Command Packet DRQ Type
    WORD  REMOVABLE_DEV     : 1;            // Device has removable media
    WORD  DEVICE_TYPE       : 5;            // Device Type
    WORD  RESERVED_13       : 1;            // Reserved for future enhancements
    WORD  PROTOCOL_TYPE     : 2;            // Protocol type in use by device
};

struct CapabilitiesFlags                    // Capabilities Word (Word 49)
{
    WORD  VENDOR_UNIQUE   : 8;              // Vendor Unique
    WORD  DMA_SUP         : 1;              // DMA mode of data transfer (optional)
    WORD  LBA_SUP         : 1;              // LBA form addressing (mandatory)
